#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.custom: Reading...
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.main: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-07370bdafa53b8c4f]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.main: Read complete after 0s [id=1077804475]
module.ecs_cluster.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:378842471989:cluster/travelapp-cluster]
module.ecr.aws_ecr_repository.main: Refreshing state... [id=travelapp-ecr]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.custom: Read complete after 0s [id=3671994505]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.example: Refreshing state... [id=travelapp-cluster]
module.vpc.aws_subnet.public_subnets[1]: Refreshing state... [id=subnet-0299bc63a7ad5223e]
module.vpc.aws_subnet.public_subnets[0]: Refreshing state... [id=subnet-01a9331b22ab97a18]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-03ab51c457fad06d3]
module.vpc.aws_route_table.main: Refreshing state... [id=rtb-0299c90bb8997687c]
module.rds_public_sg.aws_security_group.main: Refreshing state... [id=sg-079b9b8919dff4d83]
module.public_sg.aws_security_group.main: Refreshing state... [id=sg-0feda0c9e5bab127f]
module.vpc.aws_route_table_association.public_subnets_route_association[1]: Refreshing state... [id=rtbassoc-08029f31cc5f59667]
module.vpc.aws_route_table_association.public_subnets_route_association[0]: Refreshing state... [id=rtbassoc-064ff63696fb58293]
module.vpc.aws_route.igw_route[0]: Refreshing state... [id=r-rtb-0299c90bb8997687c1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs_ssm.aws_ssm_parameter.main["DB_HOSTNAME"] will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "DB_HOSTNAME"
      + tags           = {
          + "Name" = "DB_HOSTNAME-tag"
        }
      + tags_all       = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "DB_HOSTNAME-tag"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ecs_taskdef_travelapp.aws_ecs_task_definition.main will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "travelapp-taskdefintion"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "travelapp-taskdefintion"
        }
      + tags_all                 = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "travelapp-taskdefintion"
        }

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs_taskdef_travelapp.aws_iam_policy.main will be created
  + resource "aws_iam_policy" "main" {
      + arn         = (known after apply)
      + description = "ECS Custom policy allowing permissions on ECR, Cloudwatch, SSM, KMS."
      + id          = (known after apply)
      + name        = "ECS-Allow-All"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:*",
                          + "secretsmanager:*",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "kms:*",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECS-Allow-ECR-Logs-SSM-KMS-1"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "Example"
        }
    }

  # module.ecs_taskdef_travelapp.aws_iam_role.main will be created
  + resource "aws_iam_role" "main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ECS-TravelApp-Role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "ECS-TravelApp-Role"
        }
      + tags_all              = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "ECS-TravelApp-Role"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs_taskdef_travelapp.aws_iam_role_policy_attachment.main will be created
  + resource "aws_iam_role_policy_attachment" "main" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ECS-TravelApp-Role"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ssm_db_host              = (known after apply)
  + ssm_param_arns           = {
      + DB_HOSTNAME = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @bertei, Action: `pull_request`*